# Export2DGeometricObjectsIncludingPatternLines Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CustomExporter..::..Export2DGeometricObjectsIncludingPatternLines Property
CustomExporter Class See Also
---
This flag sets the exporter of 2D views to either include or exclude output of face pattern lines as part of geometric objects when the model is being processed by the export context.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public bool Export2DGeometricObjectsIncludingPatternLines { get; set; }
```

Visual Basic
---
```text
Public Property Export2DGeometricObjectsIncludingPatternLines As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Export2DGeometricObjectsIncludingPatternLines {
	bool get ();
	void set (bool value);
}
```

# Remarks
This flag is ignored if view has Wireframe display style. This flag is ignored unless property "IncludeGeometricObjects" is set to true.
# See Also
CustomExporter Class
Autodesk.Revit.DB Namespace